In [2]:
import pandas as pd
import numpy as np
df = pd.DataFrame([[1.4,np.nan],[7.1,-4.5],[np.nan,np.nan],[0.75,-1.3]],
                 index = ['a','b','c','d'],
                 columns = ['one','two'])
print(df)

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [3]:
print(df.sum())

one    9.25
two   -5.80
dtype: float64

In [4]:
print(df.sum(axis=1))
#this sums the rows instead

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [5]:
print(df.sum(axis=1, skipna=False))

a     NaN
b    2.60
c     NaN
d   -0.55
dtype: float64

In [6]:
print(df.sum(axis=0))
# Axis is 0 for DataFrame's rows and 1 for columns

one    9.25
two   -5.80
dtype: float64

In [7]:
#idxmin and idmax is used to return the indirect statistics like the index vale where 
#the minimum and maximum values are attained
print(df,'\n\n')
print(df.idxmin())

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3


one    d
two    b
dtype: object

In [8]:
print(df.idxmax())

one    b
two    d
dtype: object

In [9]:
# we can also calculate cummulative sum of the values
print(df.cumsum(axis=0))

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [10]:
print(df.describe())

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [11]:
print(df,'\n\n')
print(df.diff())

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3


   one  two
a  NaN  NaN
b  5.7  NaN
c  NaN  NaN
d  NaN  NaN

In [12]:
obj = pd.Series (['c','a','d','a','a','b','b'])
unique= obj.unique()
print(unique)

print(obj.value_counts())

print('\n series can also be sorted by value in descending order by using value_counts \n')

print(pd.value_counts(obj.values,sort=False))

['c' 'a' 'd' 'b']
a    3
b    2
d    1
c    1
dtype: int64

 series can also be sorted by value in descending order by using value_counts

c    1
a    3
d    1
b    2
dtype: int64

# COMMON FUNCTIONS OF EXCEL IN PYTHON USING PANDAS

In [13]:
import pandas as pd

df = pd.read_excel("Ecomp-data.xlsx")

print(df.head())

   account                         name                                street  \
0   211829   Kerluke, Koepp and Hilpert                    34456 Sean Highway
1   320563               Walter-Trantow                     1311 Alvis Tunnel
2   648336   Bashirian, Kunde and Price  62184 Schamberger Underpass Apt. 231
3   109996  D'Amore, Gleichner and Bode           155 Fadel Crescent Apt. 144
4   121213                Bauch-Goldner                   7274 Marissa Common

              city          state  postal-code abbrev     Jan     Feb    Mar
0       New Jaycob          Texas        28752     TX   10000   62000  35000
1    Port Khadijah  NorthCarolina        38365     NC   95000   45000  35000
2   New Lilianland           Iowa        76517     IW   91000  120000  35000
3       Hyattburgh          Maine        46021     MI   45000  120000  10000
4  Shanahanchester     California        49681     CA  162000  120000  35000

In [14]:
df['total']=df['Jan']+df['Feb']+df['Mar']
print(df.head())

   account                         name                                street  \
0   211829   Kerluke, Koepp and Hilpert                    34456 Sean Highway
1   320563               Walter-Trantow                     1311 Alvis Tunnel
2   648336   Bashirian, Kunde and Price  62184 Schamberger Underpass Apt. 231
3   109996  D'Amore, Gleichner and Bode           155 Fadel Crescent Apt. 144
4   121213                Bauch-Goldner                   7274 Marissa Common

              city          state  postal-code abbrev     Jan     Feb    Mar  \
0       New Jaycob          Texas        28752     TX   10000   62000  35000
1    Port Khadijah  NorthCarolina        38365     NC   95000   45000  35000
2   New Lilianland           Iowa        76517     IW   91000  120000  35000
3       Hyattburgh          Maine        46021     MI   45000  120000  10000
4  Shanahanchester     California        49681     CA  162000  120000  35000

    total
0  107000
1  175000
2  246000
3  175000
4  317000

In [15]:
print( df['Jan'].sum(), df['Jan'].mean(),df['Jan'].min(),df['Jan'].max())

1462000 97466.66666666667 10000 162000

In [16]:
sum_row = df[['Jan','Feb','Mar','total']].sum()
print(sum_row)

Jan      1462000
Feb      1507000
Mar       717000
total    3686000
dtype: int64

In [17]:
# to add these row sum into the dataframe as a summation row, we intially
#need to take the transpose of the sum_row, which allows to switch from being
#row-based to column-based data
df_sum= pd.DataFrame(data=sum_row).T
print(df_sum)

       Jan      Feb     Mar    total
0  1462000  1507000  717000  3686000

In [18]:
# now to add these columns sum into excel first we need to fill in the 
#missing columns. For this we use reindex
df_sum = df_sum.reindex(columns=df.columns)
print(df_sum)

   account  name  street  city  state  postal-code  abbrev      Jan      Feb  \
0      NaN   NaN     NaN   NaN    NaN          NaN     NaN  1462000  1507000

      Mar    total
0  717000  3686000

In [19]:
df_final = df.append(df_sum,ignore_index=True)
print(df_final.tail())

     account                          name                    street  \
11  231907.0                    Hahn-Moore  18115 Olivine Throughway
12  242368.0  Frami, Anderson and Donnelly           182 Bertie Road
13  268755.0                   Walsh-Haley      2624 Beatty Parkways
14  273274.0                 McDermott PLC     8917 Bergstrom Meadow
15       NaN                           NaN                       NaN

               city        state  postal-code abbrev      Jan      Feb  \
11    Norbertomouth  NorthDakota      31415.0     ND   150000    10000
12      East Davian         Iowa      72686.0    NaN   162000   120000
13     Goodwinmouth  RhodeIsland      31919.0    NaN    55000   120000
14  Kathryneborough     Delaware      27933.0    NaN   150000   120000
15              NaN          NaN          NaN    NaN  1462000  1507000

       Mar    total
11  162000   322000
12   35000   317000
13   35000   210000
14   70000   340000
15  717000  3686000

# FUZZY TEXT MATCHING TO DETERMINE THE CORRECT VALUE

In [20]:
import fuzzywuzzy as f
from fuzzywuzzy import fuzz
from fuzzywuzzy import process

state_to_code = {"VERMONT": "VT", "GEORGIA": "GA", "IOWA": "IA", "Armed Forces Pacific": "AP", "GUAM": "GU",
                 "KANSAS": "KS", "FLORIDA": "FL", "AMERICAN SAMOA": "AS", "NORTH CAROLINA": "NC", "HAWAII": "HI",
                 "NEW YORK": "NY", "CALIFORNIA": "CA", "ALABAMA": "AL", "IDAHO": "ID", "FEDERATED STATES OF MICRONESIA": "FM",
                 "Armed Forces Americas": "AA", "DELAWARE": "DE", "ALASKA": "AK", "ILLINOIS": "IL",
                 "Armed Forces Africa": "AE", "SOUTH DAKOTA": "SD", "CONNECTICUT": "CT", "MONTANA": "MT", "MASSACHUSETTS": "MA",
                 "PUERTO RICO": "PR", "Armed Forces Canada": "AE", "NEW HAMPSHIRE": "NH", "MARYLAND": "MD", "NEW MEXICO": "NM",
                 "MISSISSIPPI": "MS", "TENNESSEE": "TN", "PALAU": "PW", "COLORADO": "CO", "Armed Forces Middle East": "AE",
                 "NEW JERSEY": "NJ", "UTAH": "UT", "MICHIGAN": "MI", "WEST VIRGINIA": "WV", "WASHINGTON": "WA",
                 "MINNESOTA": "MN", "OREGON": "OR", "VIRGINIA": "VA", "VIRGIN ISLANDS": "VI", "MARSHALL ISLANDS": "MH",
                 "WYOMING": "WY", "OHIO": "OH", "SOUTH CAROLINA": "SC", "INDIANA": "IN", "NEVADA": "NV", "LOUISIANA": "LA",
                 "NORTHERN MARIANA ISLANDS": "MP", "NEBRASKA": "NE", "ARIZONA": "AZ", "WISCONSIN": "WI", "NORTH DAKOTA": "ND",
                 "Armed Forces Europe": "AE", "PENNSYLVANIA": "PA", "OKLAHOMA": "OK", "KENTUCKY": "KY", "RHODE ISLAND": "RI",
                 "DISTRICT OF COLUMBIA": "DC", "ARKANSAS": "AR", "MISSOURI": "MO", "TEXAS": "TX", "MAINE": "ME"}

c:\users\dpriyareddypothul\appdata\local\programs\python\python37-32\lib\site-packages\fuzzywuzzy\fuzz.py:11: UserWarning: Using slow pure-python SequenceMatcher. Install python-Levenshtein to remove this warning
  warnings.warn('Using slow pure-python SequenceMatcher. Install python-Levenshtein to remove this warning')

In [21]:
process.extractOne("Virginia",choices=state_to_code.keys())

('VIRGINIA', 100)

In [22]:
q=process.extractOne("New Jersey",state_to_code.keys())
print(q[0],q[1])

NEW JERSEY 100

In [25]:
def convert_state(row):
    abbrev = process.extractOne(str(row["state"]),choices=state_to_code.keys())
    if abbrev:
        return state_to_code[abbrev[0]]
    return np.nan

df_final.insert(6,"abbrev23",np.nan)
df_final.head()

,account,name,street,city,state,postal-code,abbrev23,abbrev3,abbrev,Jan,Feb,Mar,total
0,211829.0,"Kerluke, Koepp and Hilpert",34456 Sean Highway,New Jaycob,Texas,28752.0,NaN,NaN,TX,10000,62000,35000,107000
1,320563.0,Walter-Trantow,1311 Alvis Tunnel,Port Khadijah,NorthCarolina,38365.0,NaN,NaN,NC,95000,45000,35000,175000
2,648336.0,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,New Lilianland,Iowa,76517.0,NaN,NaN,IW,91000,120000,35000,246000
3,109996.0,"D'Amore, Gleichner and Bode",155 Fadel Crescent Apt. 144,Hyattburgh,Maine,46021.0,NaN,NaN,MI,45000,120000,10000,175000
4,121213.0,Bauch-Goldner,7274 Marissa Common,Shanahanchester,California,49681.0,NaN,NaN,CA,162000,120000,35000,317000

In [26]:
del df_final['abbrev']
print(df_final.tail())

     account                          name                    street  \
11  231907.0                    Hahn-Moore  18115 Olivine Throughway
12  242368.0  Frami, Anderson and Donnelly           182 Bertie Road
13  268755.0                   Walsh-Haley      2624 Beatty Parkways
14  273274.0                 McDermott PLC     8917 Bergstrom Meadow
15       NaN                           NaN                       NaN

               city        state  postal-code  abbrev23  abbrev3      Jan  \
11    Norbertomouth  NorthDakota      31415.0       NaN      NaN   150000
12      East Davian         Iowa      72686.0       NaN      NaN   162000
13     Goodwinmouth  RhodeIsland      31919.0       NaN      NaN    55000
14  Kathryneborough     Delaware      27933.0       NaN      NaN   150000
15              NaN          NaN          NaN       NaN      NaN  1462000

        Feb     Mar    total
11    10000  162000   322000
12   120000   35000   317000
13   120000   35000   210000
14   120000   70000   340000
15  1507000  717000  3686000

In [27]:
df_final['abbrev23'] = df_final.apply(convert_state,axis=1)
df_final.head()

,account,name,street,city,state,postal-code,abbrev23,abbrev3,Jan,Feb,Mar,total
0,211829.0,"Kerluke, Koepp and Hilpert",34456 Sean Highway,New Jaycob,Texas,28752.0,TX,NaN,10000,62000,35000,107000
1,320563.0,Walter-Trantow,1311 Alvis Tunnel,Port Khadijah,NorthCarolina,38365.0,NC,NaN,95000,45000,35000,175000
2,648336.0,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,New Lilianland,Iowa,76517.0,IA,NaN,91000,120000,35000,246000
3,109996.0,"D'Amore, Gleichner and Bode",155 Fadel Crescent Apt. 144,Hyattburgh,Maine,46021.0,ME,NaN,45000,120000,10000,175000
4,121213.0,Bauch-Goldner,7274 Marissa Common,Shanahanchester,California,49681.0,CA,NaN,162000,120000,35000,317000

In [28]:
del df_final['abbrev3']

In [29]:
print(df_final)

     account                              name  \
0   211829.0        Kerluke, Koepp and Hilpert
1   320563.0                    Walter-Trantow
2   648336.0        Bashirian, Kunde and Price
3   109996.0       D'Amore, Gleichner and Bode
4   121213.0                     Bauch-Goldner
5   132971.0  Williamson, Schumm and Hettinger
6   145068.0                        Casper LLC
7   205217.0                  Kovacek-Johnston
8   209744.0                    Champlin-Morar
9   212303.0                    Gerhold-Maggio
10  214098.0       Goodwin, Homenick and Jerde
11  231907.0                        Hahn-Moore
12  242368.0      Frami, Anderson and Donnelly
13  268755.0                       Walsh-Haley
14  273274.0                     McDermott PLC
15       NaN                               NaN

                                  street               city          state  \
0                     34456 Sean Highway         New Jaycob          Texas
1                      1311 Alvis Tunnel      Port Khadijah  NorthCarolina
2   62184 Schamberger Underpass Apt. 231     New Lilianland           Iowa
3            155 Fadel Crescent Apt. 144         Hyattburgh          Maine
4                    7274 Marissa Common    Shanahanchester     California
5                   89403 Casimer Spring       Jeremieburgh       Arkansas
6           340 Consuela Bridge Apt. 400  Lake Gabriellaton     Mississipi
7           91971 Cronin Vista Suite 601         Deronville    RhodeIsland
8                       26739 Grant Lock    Lake Juliannton   Pennsylvania
9              366 Maggio Grove Apt. 998          North Ras          Idaho
10             649 Cierra Forks Apt. 078           Rosaberg       Tenessee
11              18115 Olivine Throughway      Norbertomouth    NorthDakota
12                       182 Bertie Road        East Davian           Iowa
13                  2624 Beatty Parkways       Goodwinmouth    RhodeIsland
14                 8917 Bergstrom Meadow    Kathryneborough       Delaware
15                                   NaN                NaN            NaN

    postal-code abbrev23      Jan      Feb     Mar    total
0       28752.0       TX    10000    62000   35000   107000
1       38365.0       NC    95000    45000   35000   175000
2       76517.0       IA    91000   120000   35000   246000
3       46021.0       ME    45000   120000   10000   175000
4       49681.0       CA   162000   120000   35000   317000
5       62785.0       AR   150000   120000   35000   305000
6       18008.0       MS    62000   120000   70000   252000
7       53461.0       RI   145000    95000   35000   275000
8       64415.0       PA    70000    95000   35000   200000
9       46308.0       ID    70000   120000   35000   225000
10      47743.0       TN    45000   120000   55000   220000
11      31415.0       ND   150000    10000  162000   322000
12      72686.0       IA   162000   120000   35000   317000
13      31919.0       RI    55000   120000   35000   210000
14      27933.0       DE   150000   120000   70000   340000
15          NaN       NC  1462000  1507000  717000  3686000

In [30]:
df_final.to_csv('final.csv')